/**
 *
 * 文 件 名 : MdbService.h
 * 创建日期 : 2014-4-22 13:37
 * 作    者 : 邵凯田(skt001@163.com)
 * 修改日期 : $Date: $
 * 当前版本 : $Revision: $
 * 功能描述 : 内存数据库服务端程序
 * 修改记录 : 
 *            $Log: $
 *
 * Ver  Date        Author  Comments
 * ---  ----------  ------  -------------------------------------------
 * 001	2014-4-22	邵凯田　创建文件
 *
 **/

#ifndef __SKT_MDB_SERVICE_H__
#define __SKT_MDB_SERVICE_H__

#include "SSocket.h"
#include "comm/STcpServerBase.h"
#include "SService.h"
#include "MdbMgr.h" 


//////////////////////////////////////////////////////////////////////////
// 名    称:  CMdbService
// 作    者:  邵凯田
// 创建时间:  2014:4:24 15:51
// 描    述:  内存数据库服务端程序
//////////////////////////////////////////////////////////////////////////
class CMdbService : public STcpServerBase
{
public:
	CMdbService();
	virtual ~CMdbService();

	////////////////////////////////////////////////////////////////////////
	// 描    述:  服务初始化
	// 作    者:  邵凯田
	// 创建时间:  2014:4:24 16:02
	// 参数说明:  @sParams为参数属性串
	// 返 回 值:  true/false
	//////////////////////////////////////////////////////////////////////////
	bool Init(SString sParams);

	////////////////////////////////////////////////////////////////////////
	// 描    述:  启动服务
	// 作    者:  邵凯田
	// 创建时间:  2014:4:24 15:51
	// 参数说明:  void
	// 返 回 值:  true/false
	//////////////////////////////////////////////////////////////////////////
	bool StartService();

	////////////////////////////////////////////////////////////////////////
	// 描    述:  停止服务
	// 作    者:  邵凯田
	// 创建时间:  2014:4:24 15:52
	// 参数说明:  void
	// 返 回 值:  true/false
	//////////////////////////////////////////////////////////////////////////
	bool StopService();

	////////////////////////////////////////////////////////////////////////
	// 描    述:  登录回调虚函数
	// 作    者:  邵凯田
	// 创建时间:  2014:4:24 16:13
	// 参数说明:  @ip登录客户端的IP
	//            @port登录客户端的端口
	//            @sLoginHead登录字符串
	// 返 回 值:  true表示允许登录,false表示拒绝登录
	//////////////////////////////////////////////////////////////////////////
	virtual bool OnLogin(SString ip, int port, SString &sLoginHead);

	////////////////////////////////////////////////////////////////////////
	// 描    述:  会话线程接收到报文后的回调虚函数，派生类通过此函数处理即时消息
	// 作    者:  邵凯田
	// 创建时间:  2014:4:24 16:23
	// 参数说明:  @pSession为会话实例指针，可以通过指针向对端发送数据
	//            @pPackage为刚接收到的数据包
	// 返 回 值:  true表示已经处理完毕，此报文可以释放了，false表示未处理，此报文应放入接收队列
	//////////////////////////////////////////////////////////////////////////
	virtual bool OnRecvFrame(STcpServerSession *pSession, stuSTcpPackage *pPackage);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  删除会话的回调虚函数
	// 作    者:  邵凯田
	// 创建时间:  2014-10-17 14:50
	// 参数说明:  @pSession为即将将删除的会话实例
	// 返 回 值:  void
	//////////////////////////////////////////////////////////////////////////
	virtual void OnDeleteSession(STcpServerSession *pSession);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  发送触发信息
	// 作    者:  邵凯田
	// 创建时间:  2014-10-17 14:56
	// 参数说明:  @pTable为指定的表
	// 返 回 值:  void
	//////////////////////////////////////////////////////////////////////////
	void SendTrigger(CMdbTable *pTable);

	CMdbManager* GetMdbMgrPtr(){ return &m_MdbMgr; };
	inline int GetTcpPort(){return m_iPort;};
	inline SString GetDbUser(){return m_sDbUser;};
	inline SString GetDbPwd(){return m_sDbPwd;};

private:
	int m_iPort;		//TCP端口号
	SString m_sDbUser;	//用户名
	SString m_sDbPwd;	//密码
	CMdbManager m_MdbMgr;//内存库管理实例
	SLock m_TrgLock;	//触发发送的同步锁，不允许两个SendTrigge任务同时运行
};

#endif /*__SKT_MDB_SERVICE_H__*/
